_protected/views/site/defcount.php

SELECT * FROM `shops`
---
                <div class="col-md-2">
                    <?
                    $v_shops = ($value['sh_name']) ? [$value['sh_name'] => $value['sh_name']] : ['0' => '<--Tsexni tanlang-->'];
                    $items = $activities = $v_shops + ['0' => '<--Tsexni tanlang-->'] + ArrayHelper::map(\app\models\Shops::find()->all(), 'name', 'name');

SELECT * FROM `models`
---
                <div class="col-md-2">
                    <?
                    $v_models = ($value['model_name']) ? [$value['model_name'] => $value['model_name']] : ['0' => '<--Modelni tanlang-->'];
                    $items = $activities = $v_models + ['0' => '<--Modelni tanlang-->'] + ArrayHelper::map(\app\models\Models::find()->all(), 'model_name', 'model_name');

SELECT * FROM `defect_list`
---
                <div class="col-md-2">
                    <?
                    $v_def = ($value['defect_name']) ? [$value['defect_name'] => $value['defect_name']] : ['0' => '<--Defekt tanlang-->'];
                    $items = $activities = $v_def + ['0' => '<--Defekt tanlang-->'] + ArrayHelper::map(\app\models\DefectList::find()->all(), 'defect_name', 'defect_name');