_protected/controllers/VehicleDefectsController.php

    public function actionDefectxorazm(){

        $model = new Vehicles();
        if ($model->load(Yii::$app->request->post())) {
//            print_r('sasas'); die();
            $con = new Mssql();
            $mssql = $con->selectSash($model->pono);
//            var_dump($mssql); die();
            return $this->redirect(['defectxorazm', 'mssql' => $mssql, ]);
        }
        $shops = Shops::find()->asArray()->all();
        $level1 = Level1::find()->asArray()->all();
        $defect = DefectList::find()->asArray()->all();
---
SELECT * FROM `shops`
SELECT * FROM `level_1`
SELECT * FROM `defect_list`