_protected/modules/admin/views/vehicles/index.php

            'pono',
            'vin_number',
//            'model.model_name',
            [
                'attribute' => 'model_id',
                'value' => 'model.model_name',
                'header' => 'Model nomi',
                'filter' => ArrayHelper::map(\app\models\Models::find()->all(), 'id', 'model_name'),
            ],
---
SELECT * FROM `models` WHERE `id`=1
SELECT * FROM `models`