_protected/models/VehicleDefectsSearch.php

SELECT * FROM `users` WHERE `branch_id`=1
---
    public function search($params)
    {
        $b_id = \Yii::$app->user->identity->branch_id;
//        $u = User::find()->where(['in','branch_id', $b_id])->all();
        $u = User::find()->where(['branch_id' => $b_id])->asArray()->all();