_protected/modules/admin/controllers/ModelsController.php

SELECT * FROM `models` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Models::findOne($id)) !== null) {