_protected/modules/admin/views/vehicle-defects/index.php

                'attribute' => 'model_code',
                'value' => 'vehicledef.model.model_code',
                'header' => 'Model-kod',
                'filter' => ArrayHelper::map(\app\models\Models::find()->all(), 'model_code', 'model_code'),
---
SELECT * FROM `models`

                'attribute' => 'model_name',
                'value' => 'vehicledef.model.model_name',
                'header' => 'Model nomi',
                'filter' => ArrayHelper::map(\app\models\Models::find()->all(), 'model_name', 'model_name'),
            ],
            [
                'attribute' => 'shop_id',
                'value' => function ($data) {
                    return $data->shop->name;
                },
                'filter' => ArrayHelper::map(\app\models\Shops::find()->all(), 'id', 'name'),
            ],
---
SELECT * FROM `models`
SELECT * FROM `shops` WHERE `id`=3
SELECT * FROM `shops`

                'filter' => [2 => 'IN', 1 => 'OUT'],

            ],
            [
                'attribute' => 'level1_id',
                'value' => function ($data) {
                    return $data->level1->name;
                },
                'filter' => ArrayHelper::map(\app\models\Level1::find()->all(), 'id', 'name'),
            ],
            [
                'attribute' => 'level2_id',
                'value' => function ($data) {
                    return $data->level2->name;
                },
                'filter' => !empty($searchModel->level1_id) ?
                    ArrayHelper::map(\app\models\Level2::find()->where(['level1_id' => $searchModel->level1_id])->all(), 'id', 'name') :
                    ArrayHelper::map(\app\models\Level2::find()->all(), 'id', 'name'),
                'contentOptions' => ['style' => 'white-space: break-spaces; vertical-align: middle;'],
            ],
            [
                'attribute' => 'level3_id',
                'value' => function ($data) {
                    return $data->level3->name;
                },
                'filter' => !empty($searchModel->level2_id) ?
                    ArrayHelper::map(\app\models\Level3::find()->where(['level2_id' => $searchModel->level2_id])->all(), 'id', 'name') :
                    ArrayHelper::map(\app\models\Level3::find()->all(), 'id', 'name'),
            ],
---
SELECT * FROM `level_1` WHERE `id`=1
SELECT * FROM `level_1`
SELECT * FROM `level_2` WHERE `id`=2
SELECT * FROM `level_2`
SELECT * FROM `level_3` WHERE `id`=10
SELECT * FROM `level_3`

                },
                'contentOptions' => ['style' => 'white-space: break-spaces; text-align: center;vertical-align: middle;'],
            ],
            [
                'attribute' => 'defect_id',
                'value' => function ($data) {
                    return $data->def->defect_name;
                },
                'filter' => ArrayHelper::map(\app\models\DefectList::find()->all(), 'id', 'defect_name'),
            ],
---
SELECT * FROM `defect_list` WHERE `id`=2
SELECT * FROM `defect_list`